Revit 2027 API
PointCollection.GetPointBufferPointer Method
 Returns an unsafe pointer to the buffer in which this collection stores the points.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntPtr GetPointBufferPointer()
Public Function GetPointBufferPointer As IntPtr
public:
IntPtr GetPointBufferPointer()
member GetPointBufferPointer : unit -> IntPtr
Return Value
IntPtr
 The pointer to the collection's storage.
See Also
Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace